# ProgressDlgSetTopMsg

## Description
Set top message of a progress dialog.

```pascal
PROCEDURE ProgressDlgSetTopMsg(message : STRING);
```

```python

def vs.ProgressDlgSetTopMsg(message):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|message|STRING||

## Version
Availability: from Vectorworks 2015
## Category
* Utility